public static void main(String[]args){
    // 입력을 처리하는 부분
        //Java 함 줄 씩 읽으면 된다

        // 스택의 구현
            //자바의 경우 ARRAYLIST
        //명령어를 구현하는 부분... 총 10개 정도
            // 가장 중요하다고 생각함
            // 예외처리 때문에
                // 뭔가 값을 POP 해야하는데 없거나
                // divide해야하는데 0이거나
                // 값을 연산했는데 값이 너무 크거나... 10^9
                    // 변수타입... 보통 int 쓰실텐데
                    // Long을 쓰셔야함 ... 특히 곱하기
                // 더 예외들이 있음... 다 찾아 봐야야
        // 초기화 + 각각의 연산을 수행하는 로직
       }